neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32F0.c
        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        DMA_NVIC_Init_Status[channel_index] = false;

        switch(channel_index)
        {
#if defined (STM32F030x6) || defined (STM32F030x8) ||                           \
    defined (STM32F031x6) || defined (STM32F038xx) ||                           \
    defined (STM32F042x6) || defined (STM32F048xx) || defined (STM32F070x6) || \
    defined (STM32F051x8) || defined (STM32F058xx) ||                           \
    defined (STM32F070xB)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_4] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel4_5_IRQn);
                        }
                        break;
#endif
#elif defined (STM32F071xB) || defined (STM32F072xB) || defined (STM32F078xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#if defined (DMA1_Channel2) && defined (DMA1_Channel3)
                        if(!DMA_NVIC_Init_Status[hwDMA_Channel_Index_2] && !DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
#endif
                        {
                                HAL_NVIC_DisableIRQ(DMA1_Channel2_3_IRQn);
                        }
                        break;
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
                        {
                                bool dma1_4_7_used = false;

#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_used = true;
                                }
#endif
                                if (!dma1_4_7_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Channel4_7_IRQn);
                                }
                        }
                        break;
#endif
#elif defined (STM32F091xC) || defined (STM32F098xx)
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#endif
#if defined (DMA1_BASE)
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                case hwDMA_Channel_Index_9:
#endif
#if defined (DMA2_Channel2)
                case hwDMA_Channel_Index_10:
#endif
#endif
                        {
                                bool dma1_2_3_dma2_1_2_used = false;

#if defined (DMA1_BASE)
#if defined (DMA1_Channel2)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_2])
                                {
                                        dma1_2_3_dma2_1_2_used = true;
                                }
#endif
#if defined (DMA1_Channel3)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_3])
                                {
                                        dma1_2_3_dma2_1_2_used = true;
                                }
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_8])
                                {
                                        dma1_2_3_dma2_1_2_used = true;
                                }
#endif
#if defined (DMA2_Channel2)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_9])
                                {
                                        dma1_2_3_dma2_1_2_used = true;
                                }
#endif
#endif
                                if (!dma1_2_3_dma2_1_2_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Ch2_3_DMA2_Ch1_2_IRQn);
                                }
                        }
                        break;
#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel3)
                case hwDMA_Channel_Index_11:
#endif
#if defined (DMA2_Channel4)
                case hwDMA_Channel_Index_12:
#endif
#if defined (DMA2_Channel5)
                case hwDMA_Channel_Index_13:
#endif
#endif
                        {
                                bool dma1_2_3_dma2_1_2_used = false;

#if defined (DMA1_BASE)
#if defined (DMA1_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_4])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#if defined (DMA1_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_5])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#if defined (DMA1_Channel6)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_6])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#if defined (DMA1_Channel7)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_7])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#endif
#if defined (DMA2_BASE)
#if defined (DMA2_Channel3)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_10])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#if defined (DMA2_Channel4)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_11])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#if defined (DMA2_Channel5)
                                if(DMA_NVIC_Init_Status[hwDMA_Channel_Index_12])
                                {
                                        dma1_4_7_dma2_3_5_used = true;
                                }
#endif
#endif
                                if (!dma1_4_7_dma2_3_5_used)
                                {
                                        HAL_NVIC_DisableIRQ(DMA1_Ch4_7_DMA2_Ch3_5_IRQn);
                                }
                        }
                        break;
#else
#if defined (DMA1_BASE)
#if defined (DMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
                        break;
#endif
#if defined (DMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_DisableIRQ(DMA1_Channel2_IRQn);
                        break;
#endif
#if defined (DMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_DisableIRQ(DMA1_Channel3_IRQn);
                        break;
#endif
#if defined (DMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_DisableIRQ(DMA1_Channel4_IRQn);
                        break;
#endif
#if defined (DMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);
                        break;
#endif
#if defined (DMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_DisableIRQ(DMA1_Channel6_IRQn);
                        break;
#endif
#if defined (DMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_DisableIRQ(DMA1_Channel7_IRQn);
                        break;
#endif
#endif //DMA1_BASE
#if defined (DMA2_BASE)
#if defined (DMA2_Channel1)
                case hwDMA_Channel_Index_9:
                        HAL_NVIC_DisableIRQ(DMA2_Channel1_IRQn);
                        break;
#endif
#if defined (DMA2_Channel2)
                case hwDMA_Channel_Index_10:
                        HAL_NVIC_DisableIRQ(DMA2_Channel2_IRQn);
                        break;
#endif
#if defined (DMA2_Channel3)
                case hwDMA_Channel_Index_11:
                        HAL_NVIC_DisableIRQ(DMA2_Channel3_IRQn);
                        break;
#endif
#if defined (DMA2_Channel4)
                case hwDMA_Channel_Index_12:
                        HAL_NVIC_DisableIRQ(DMA2_Channel4_IRQn);
                        break;
#endif
#if defined (DMA2_Channel5)
                case hwDMA_Channel_Index_13:
                        HAL_NVIC_DisableIRQ(DMA2_Channel5_IRQn);
                        break;
#endif
#if defined (DMA2_Channel6)
                case hwDMA_Channel_Index_14:
                        HAL_NVIC_DisableIRQ(DMA2_Channel6_IRQn);
                        break;
#endif
#if defined (DMA2_Channel7)
                case hwDMA_Channel_Index_15:
                        HAL_NVIC_DisableIRQ(DMA2_Channel7_IRQn);
                        break;
#endif
#endif //DMA2_BASE
#endif
        }

